load-test/campaigns/2026-08-06_minimal-stability-final/scenarios/stability-300.yml
# 라운드 B — 목표의 2.5배 도착 300 req/s. 사전 등록: ../README.md §7
#
# 세 라운드가 같은 요청 믹스를 쓴다 (부하 크기만 다르다). 믹스를 라운드마다 바꾸면
# "부하 때문인가 믹스 때문인가"를 나눌 수 없다.
#
# phases는 단독 정의한다 — Artillery `environments`는 phase 배열을 원소 단위로 병합해
# 기본 프로파일이 잔존한다 (#381 측정 폐기 원인, 함정 목록).
config:
  target: "http://localhost:8082"
  payload:
    # campaigns/<캠페인>/scenarios/ 기준 (실제 파일: load-test/data/users.csv)
    path: "../../../data/users.csv"
    fields:
      - token
    order: random
    skipHeader: true
  # 커서에는 필터 지문이 박혀 있다 (`...|201|1|7|12`). 2페이지에서 태그가 하나라도 달라지면
  # 서버가 400 PLACE-003으로 거절한다(실측). 그래서 태그를 `$randomNumber`로 매 요청 뽑지
  # 않고 시나리오 단위로 고정되는 config.variables로 뽑는다 — 실제 사용자 흐름과도 같다.
  variables:
    subA: [7, 8, 9, 10]      # OPTION1, parent = 1
    subB: [11, 12, 13, 14, 15, 16]  # OPTION2, parent = 1
  phases:
    - name: "Warm up"
      duration: 20
      arrivalRate: 60
    - name: "Ramp up"
      duration: 20
      arrivalRate: 60
      rampTo: 300
    - name: "Sustained load"
      duration: 60
      arrivalRate: 300
  plugins:
    metrics-by-endpoint:
      useOnlyRequestNames: true

scenarios:
  # ── 무태그 ────────────────────────────────────────────────────────────────
  # 동네 단위 인기순 첫 페이지 — 홈 기본 진입. 서울 leaf(301~318)
  - name: "popular-town"
    weight: 25
    flow:
      - get:
          url: "/api/places"
          qs:
            townId: "{{ $randomNumber(301, 318) }}"
            isBookmarkSearch: false
            sort: "POPULAR"
            size: 20
          name: "popular-town-p1"
          headers:
            Authorization: "Bearer {{ token }}"

  # 동네 단위 최신순 첫 페이지 — V31 인덱스가 서빙하는 경로
  - name: "latest-town"
    weight: 15
    flow:
      - get:
          url: "/api/places"
          qs:
            townId: "{{ $randomNumber(301, 318) }}"
            isBookmarkSearch: false
            sort: "LATEST"
            size: 20
          name: "latest-town-p1"
          headers:
            Authorization: "Bearer {{ token }}"

  # 시 단위(서울=201, leaf 18곳 합집합) 인기순 — 첫 페이지 → 커서 2페이지
  - name: "popular-city-scroll"
    weight: 20
    flow:
      - get:
          url: "/api/places"
          qs:
            townId: 201
            isBookmarkSearch: false
            sort: "POPULAR"
            size: 20
          name: "popular-city-p1"
          headers:
            Authorization: "Bearer {{ token }}"
          capture:
            json: "$.data.nextCursor"
            as: "cursorPop"
      - get:
          url: "/api/places"
          qs:
            townId: 201
            isBookmarkSearch: false
            sort: "POPULAR"
            size: 20
            cursor: "{{ cursorPop }}"
          name: "popular-city-p2"
          headers:
            Authorization: "Bearer {{ token }}"
          ifTrue: "cursorPop"

  # ── 태그 필터 (이번 개선의 대상 경로) ──────────────────────────────────────
  # 시 단위 인기순 + 메인 1(카페) + 서브A(OPTION1) + 서브B(OPTION2).
  # 세 태그 모두 parent=1이라 TagValidator.validatePlaceTagConditions를 통과한다.
  - name: "popular-city-tag3-scroll"
    weight: 25
    flow:
      - get:
          url: "/api/places"
          qs:
            townId: 201
            isBookmarkSearch: false
            sort: "POPULAR"
            mainTagId: 1
            subTagAIdList: "{{ subA }}"
            subTagBIdList: "{{ subB }}"
            size: 20
          name: "popular-city-tag3-p1"
          headers:
            Authorization: "Bearer {{ token }}"
          capture:
            json: "$.data.nextCursor"
            as: "cursorTagPop"
      - get:
          url: "/api/places"
          qs:
            townId: 201
            isBookmarkSearch: false
            sort: "POPULAR"
            mainTagId: 1
            subTagAIdList: "{{ subA }}"
            subTagBIdList: "{{ subB }}"
            size: 20
            cursor: "{{ cursorTagPop }}"
          name: "popular-city-tag3-p2"
          headers:
            Authorization: "Bearer {{ token }}"
          ifTrue: "cursorTagPop"

  # 시 단위 최신순 + 같은 태그 3개 — 커서가 정렬 축(created_at)을 타는 경로
  - name: "latest-city-tag3-scroll"
    weight: 15
    flow:
      - get:
          url: "/api/places"
          qs:
            townId: 201
            isBookmarkSearch: false
            sort: "LATEST"
            mainTagId: 1
            subTagAIdList: "{{ subA }}"
            subTagBIdList: "{{ subB }}"
            size: 20
          name: "latest-city-tag3-p1"
          headers:
            Authorization: "Bearer {{ token }}"
          capture:
            json: "$.data.nextCursor"
            as: "cursorTagLat"
      - get:
          url: "/api/places"
          qs:
            townId: 201
            isBookmarkSearch: false
            sort: "LATEST"
            mainTagId: 1
            subTagAIdList: "{{ subA }}"
            subTagBIdList: "{{ subB }}"
            size: 20
            cursor: "{{ cursorTagLat }}"
          name: "latest-city-tag3-p2"
          headers:
            Authorization: "Bearer {{ token }}"
          ifTrue: "cursorTagLat"